feat: change to mermaid diagram
